tap "anomalyco/tap"
tap "aws/tap"
tap "homebrew/brew-vulns"
tap "mohamedelashri/free-mac"
tap "withgraphite/tap"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Simple terminal UI for git commands
brew "lazygit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Language Server for the Lua language
brew "lua-language-server"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Swiss-army knife of markup format conversion
brew "pandoc"
# AI agent toolkit
brew "pi-coding-agent"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python-freethreading"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Check Homebrew packages for known vulnerabilities via osv.dev
brew "homebrew/brew-vulns/brew-vulns"
# Universal database tool and SQL client
cask "dbeaver-community"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Image viewer
cask "qview"
go "github.com/spf13/cobra-cli"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
cargo "cargo-audit"
cargo "cargo-deny"
cargo "cargo-tarpaulin"
cargo "cargo-udeps"
cargo "cargo-update"
cargo "jj-cli"
cargo "kanata"
cargo "sacad"
cargo "stylua"
cargo "tree-sitter-cli"
cargo "trunk"
cargo "zqa"
